app/Http/Controllers/Api/AuthController.php

    public function register(Request $request)
    {
        $newUser = new User();
        $newUser->name = $request->name;
        $newUser->email = $request->email;
        $newUser->password = Hash::make($request->password);

        if ($newUser->save()) {
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('IMALET', 'imaletBenjamin@gmail.com', '$2y$12$ultxwHDPsjSivXvEtopbTepd8QJFB/OtdY0LYp5Bz..U5ott64Q.u', '2024-03-18 19:16:40', '2024-03-18 19:16:40')